### Dataset: https://www.kaggle.com/datasets/kaggle/sf-salaries

In [28]:
import pandas as pd
import numpy as np

In [3]:
df = pd.read_csv('Salaries.csv', low_memory=False)

In [4]:
# Display top 5 rows
df.head(5)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [5]:
# Basic info for dataset
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148049 non-null  float64
 4   OvertimePay       148654 non-null  float64
 5   OtherPay          148654 non-null  float64
 6   Benefits          112495 non-null  float64
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(7), int64(2), object(4)
memory usage: 14.7+ MB

In [6]:
df.isnull().sum()

Id                       0
EmployeeName             0
JobTitle                 0
BasePay                605
OvertimePay              0
OtherPay                 0
Benefits             36159
TotalPay                 0
TotalPayBenefits         0
Year                     0
Notes               148654
Agency                   0
Status              110535
dtype: int64

In [7]:
# Drop Id, Notes, Agency, Status
# to drop rows axis=0, to drop columns axis=1

df = df.drop(['Id','Notes','Agency','Status'], axis=1)

In [8]:
df.describe(include='all')

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year
count,148654,148654,148049.000000,148654.000000,148654.000000,112495.000000,148654.000000,148654.000000,148654.000000
unique,110810,2159,NaN,NaN,NaN,NaN,NaN,NaN,NaN
top,Kevin Lee,Transit Operator,NaN,NaN,NaN,NaN,NaN,NaN,NaN
freq,13,7036,NaN,NaN,NaN,NaN,NaN,NaN,NaN
mean,NaN,NaN,66323.656854,5065.923568,3648.669115,25007.003942,74768.321972,93692.554811,2012.522643
std,NaN,NaN,42765.447379,11454.256594,8056.515703,15402.663885,50517.005274,62793.533483,1.117538
min,NaN,NaN,-166.010000,-0.010000,-7058.590000,-33.890000,-618.130000,-618.130000,2011.000000
25%,NaN,NaN,33583.520000,0.000000,0.000000,11527.730000,36168.995000,44065.650000,2012.000000
50%,NaN,NaN,65006.930000,0.000000,811.170000,28627.780000,71426.610000,92404.090000,2013.000000
75%,NaN,NaN,94691.050000,4657.632500,4235.907500,35566.730000,105839.135000,132876.450000,2014.000000
max,NaN,NaN,319275.010000,245131.880000,400184.250000,96570.660000,567595.430000,567595.430000,2014.000000

In [11]:
# Find top 5 employee names
df['EmployeeName'].value_counts().head(5)

Kevin Lee       13
Steven Lee      11
William Wong    11
Richard Lee     11
Stanley Lee      9
Name: EmployeeName, dtype: int64

In [15]:
# Number of unique job titles
len(df['JobTitle'].unique())

2159

In [21]:
# Total number of job titles containing the word 'Captain'
len(df[df['JobTitle'].str.contains('Captain', case=False)])

552

In [23]:
# Display all employee names from Fire Dept.
df[df['JobTitle'].str.contains('FIRE DEPARTMENT', case=False)][['EmployeeName','JobTitle']]

                EmployeeName                                          JobTitle
4            PATRICK GARDNER      DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)
6                  ALSON LEE                BATTALION CHIEF, (FIRE DEPARTMENT)
8             MICHAEL MORRIS                BATTALION CHIEF, (FIRE DEPARTMENT)
9         JOANNE HAYES-WHITE            CHIEF OF DEPARTMENT, (FIRE DEPARTMENT)
10             ARTHUR KENNEY  ASSISTANT CHIEF OF DEPARTMENT, (FIRE DEPARTMENT)
...                      ...                                               ...
32623           JAMES BARDEN                BATTALION CHIEF, (FIRE DEPARTMENT)
36162     Joanne Hayes-White                            Chief, Fire Department
72926   Joanne M Hayes-White                            Chief, Fire Department
102303        Robert E Evans                        Captain, (Fire Department)
110535  Joanne M Hayes-White                            Chief, Fire Department

[226 rows x 2 columns]

In [26]:
# Find minimum, maximum, and average base pay"
df['BasePay'].describe()

count    148049.000000
mean      66323.656854
std       42765.447379
min        -166.010000
25%       33583.520000
50%       65006.930000
75%       94691.050000
max      319275.010000
Name: BasePay, dtype: float64

In [33]:
# Replace 'Not provided' in 'EmployeeName' column with NaN
df['EmployeeName'] = df['EmployeeName'].replace('Not provided',np.NaN)

In [43]:
# Find job title of 'Albert Pardini'
df[df['EmployeeName']=='ALBERT PARDINI'][['EmployeeName','JobTitle']]

     EmployeeName                         JobTitle
2  ALBERT PARDINI  CAPTAIN III (POLICE DEPARTMENT)

In [45]:
# Find total pay for 'Albert Pardini', including benefits
df[df['EmployeeName']=='ALBERT PARDINI'][['EmployeeName','TotalPayBenefits']]

     EmployeeName  TotalPayBenefits
2  ALBERT PARDINI         335279.91

In [50]:
# Display name of person with highest base pay
df[df['BasePay'].max()==df['BasePay']]['EmployeeName']

72925    Gregory P Suhr
Name: EmployeeName, dtype: object

In [52]:
# Find average base pay of all employees per year
df.groupby('Year').mean()['BasePay']

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66557.437750
Name: BasePay, dtype: float64

In [54]:
# Find average base pay of all employees by Job Title
df.groupby('JobTitle').mean()['BasePay']

JobTitle
0                                                     0.000000
ACCOUNT CLERK                                     43300.806506
ACCOUNTANT                                        46643.172000
ACCOUNTANT INTERN                                 28732.663958
ACPO,JuvP, Juv Prob (SFERS)                       62290.780000
                                                      ...
X-RAY LABORATORY AIDE                             47664.773077
X-Ray Laboratory Aide                             46086.387100
YOUTH COMMISSION ADVISOR, BOARD OF SUPERVISORS    52609.910000
Youth Comm Advisor                                39077.957500
ZOO CURATOR                                       43148.000000
Name: BasePay, Length: 2159, dtype: float64

In [57]:
# Find average base pay of employees with 'accountant' in the job title
df[df['JobTitle']=='ACCOUNTANT']['BasePay'].mean()

46643.172

In [59]:
# Find the top 5 most common jobs
df['JobTitle'].value_counts().head()

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64